Ответ на задание 4:
	
	Указанная в задании скобочная последовательность: [((())()(())]]
			Не является правильной, т.к. при счете слева-направо для второй открывающей 
			скобки(круглой) не соответсвующей ей закрывающей (круглой), только квадратная.
			Исправить данную последовательность можно так: 
			1) добавить открывающей круглой в недостающую закрывающую круглую, 
	        а закрывающей квадратной - открывающую квадратную;
			2)удалить из последовательности не парные скобки: 
			круглую открывающую и квадратную закрывающую.
			
			